using System;
/**=============================================================
 * <summary> UI子系統介面</summary>
 * 
 * <author>Neymar Liu</author>
 * <date>$time$</date>
 * 
 * Copyright (c) 2014 All Rights Reserved
 =============================================================*/

namespace UIFrameWork
{
	public interface IUIInterface
	{
		bool visible
		{
			get;
			set;
		}

		/**=============================================
		 * 開啟
		 * ===========================================*/
		void Open(params object[] values);
		
		/**=============================================
		 * 開啟介面的動態
		 * ===========================================*/
		void OpenTween(params object[] values);

		/**=============================================
		 * 關閉
		 * ===========================================*/
		void Close();
		
		/**=============================================
		 * 關閉介面的動態
		 * ===========================================*/
		void CloseTween();
	}
}
